app/controllers/web/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mrliocha@yandex.ru"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Liocha"], ["email", "mrliocha@yandex.ru"], ["created_at", "2022-04-09 19:21:04.224431"], ["updated_at", "2022-04-09 19:21:04.224431"]]
---
  def callback
    email = auth[:info][:email].downcase
    nickname = auth[:info][:nickname]
    @user = User.find_by(email: email)

    unless  @user
      @user = User.new(email: email, name: nickname)
      @user.save