app/controllers/web/bulletins_controller.rb

  def index
    @bulletins = Bulletin.all
---
SELECT "bulletins".* FROM "bulletins"

  def create
    pp bulletin_params
    @bulletin = current_user.bulletins.build(bulletin_params)
    if @bulletin.save
---
INSERT INTO "bulletins" ("category_id", "creator_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 1], ["creator_id", 1], ["title", "sdadsa"], ["description", "asdadadad"], ["created_at", "2022-04-17 23:03:30.013591"], ["updated_at", "2022-04-17 23:03:30.013591"]]

  def update
    respond_to do |format|
      if @bulletin.update(bulletin_params)
---
UPDATE "bulletins" SET "updated_at" = ? WHERE "bulletins"."id" = ?  [["updated_at", "2022-04-17 23:03:30.070819"], ["id", 1]]

  def destroy
    @bulletin.destroy
---
DELETE FROM "bulletins" WHERE "bulletins"."id" = ?  [["id", 1]]

  def set_bulletin
    @bulletin = Bulletin.find(params[:id])
---
SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]