app/controllers/web/home_controller.rb

SELECT "bulletins".* FROM "bulletins"
---
  def index
    @bulletins = Bulletin.all