app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def current_user
    return unless session[:user_id]

    @user = User.find(session[:user_id])