app/controllers/users_controller.rb

INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "me"], ["password", "1"], ["created_at", "2022-04-03 01:15:51.463818"], ["updated_at", "2022-04-03 01:15:51.463818"]]
---
  def create
    @user = User.new(user_params)

    if @user.save