app/controllers/welcome_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def homepage
    pp session[:user_id]
    @user = User.find(session[:user_id]) if session[:user_id]